% this is 16r/planning/packing_plan.org
% generated by ../maize/crops/merge_plan_data.perl
% on Fri May 20 13:07:18 CDT 2016 for crop 16r.
%
% The most recent plan data are derived from ../demeter/data/plan.pl for the 15r.  These
% are substituted into the packing_plan.pl data for 15r to generate
% packing_plan/10 facts that are in the previous sequence, but not numbered.
%
% Wait until all packing_plan/10 facts are written, and in the correct sequence,
% before re-running the script to insert the sequence numbers for planting!




** strategy and tables

In 17r, need to do serious bulking and push recessives along.  Relatively
few bcs in dominants, and those that are are mostly stalled or rebuilds.



#+tblname: planning
| type             | num rows | modified |
|------------------+----------+----------|
| elite            |        5 |        5 |
| double haploid   |        5 |        5 |
| selves           |      3.5 |      3.5 |
| Les15            |       20 |        0 |
| lls1*            |        6 |        0 |
| other recess     |     29.5 |     11.5 |
| bulks for flying |       12 |       13 |
| dominants        |     29.5 |     27.5 |
| miscellany       |     15.5 |        0 |
| total non-inbred |     197. |     65.5 |
| inbred           |          |       25 |
| total rows       |          |     90.5 |
#+TBLFM: @11$3=vsum(@2..@10)::@13$3=vsum(@11..@12)










M14 compensatn rate =  1.6560510 from 15r

66 1st
45 2nd
0 3rd

#+NAME:inbreds
|                                           |      S |      W |     M |    B | total rows by plntg |
|-------------------------------------------+--------+--------+-------+------+---------------------|
| over-planting factors                     |    1.3 |    1.3 |   1.7 |  1.3 |                 0.5 |
|-------------------------------------------+--------+--------+-------+------+---------------------|
| 1st plntg lines                           |     11 |     11 |    21 |    8 |                     |
| 2nd plntg lines                           |      7 |     13 |    12 |    8 |                     |
|-------------------------------------------+--------+--------+-------+------+---------------------|
| 1st plntg ears                            |     33 |     33 |    63 |   24 |                     |
| 2nd plntg ears                            |     21 |     39 |    36 |   24 |                     |
|-------------------------------------------+--------+--------+-------+------+---------------------|
| 1st plntg rows, inc losses                |  2.145 |  2.145 | 5.355 | 1.56 |              11.205 |
| 2nd plntg rows, inc losses                |  1.365 |  2.535 |  3.06 | 1.56 |                8.52 |
| true 1st plntg rows + some 2nd plntg rows | 2.8275 | 3.4125 | 6.885 | 2.34 |              15.465 |
| actual 3rd plntg rows                     |      0 |      0 |     0 |    0 |                   0 |
| rows by inbreds, all plantings            | 4.1925 | 5.9475 | 9.945 |  3.9 |                     |
|-------------------------------------------+--------+--------+-------+------+---------------------|
| rounded 1st plntg rows                    |      3 |      3 |     7 |    2 |                  15 |
| rounded 2nd plntg rows                    |      2 |      3 |     3 |    2 |                  10 |
| rounded 3rd plntg rows                    |      0 |      0 |     0 |    0 |                   0 |
| total rounded rows                        |      5 |      6 |    10 |    4 |                  25 |
|                                           |        |        |       |      |                     |
#+TBLFM: @5$2=@-2*3::@5$3=@-2*3::@5$4=@-2*3::@5$5=@-2*3::@6$2=@-2*3::@6$3=@-2*3::@6$4=@-2*3::@6$5=@-2*3::@7$2=(@-2/20)*@-5::@7$3=(@-2/20)*@-5::@7$4=(@-2/20)*@-5::@7$5=(@-2/20)*@-5::@8$2=(@-2/20)*@-6::@8$3=(@-2/20)*@-6::@8$4=(@-2/20)*@-6::@8$5=(@-2/20)*@-6::@8$6=vsum($2..$5)::@9$2=@-2+(@-1*@2$6)::@9$3=@-2+(@-1*@2$6)::@9$4=@-2+(@-1*@2$6)::@9$5=@-2+(@-1*@2$6)::@9$6=vsum($2..$5)::@10$6=vsum($2..$5)::@11$2=vsum(@8..@10)::@11$3=vsum(@8..@10)::@11$4=vsum(@8..@10)::@11$5=vsum(@8..@10)::@12$2=round(@-3)::@12$3=round(@-3)::@12$4=round(@-3)::@12$5=round(@-3)::@12$6=vsum($2..$5)::@13$2=round(@-5)+1::@13$3=round(@-5)::@13$4=round(@-5)::@13$5=round(@-5)::@13$6=vsum($2..$5)::@14$2=round(@-4)::@14$3=round(@-4)::@14$4=round(@-4)::@14$5=round(@-4)::@14$6=vsum($2..$5)::@15$2=vsum(@12..@14)::@15$3=vsum(@12..@14)::@15$4=vsum(@12..@14)::@15$5=vsum(@12..@14)::@15$6=vsum($2..$5)


#+NAME:rows
|----------------------------------------+-------|
| full rows elite/doubled haploids       |    10 |
| half rows mutants                      |   111 |
| full rows inbreds                      |    25 |
| total stakes                           |   146 |
| total physical rows                    |  90.5 |
| gerry's rows                           |    20 |
| total rows needed, exclusive of border | 110.5 |
|                                        |       |
#+TBLFM: @1$2=10::@3$2=remote(inbreds,@15$6)::@4$2=@1 + @2 + @3::@5$2=@1 + @3 + @2/2::@7$2=@5+@6





